var apiCity = ymaps.geolocation;
        var i, ii, delivery;
        var flag = true;
        var shopAdress = {
                "Великий Новгород" : "ТД Русь, 1 этаж",
                "Санкт-Петербург" : "ТРК Лиговъ, 2 этаж",
            }
        var deliveryAdress = {
                'Абакан' : 'Самовывоз: ул. Чертыгашева, 126, 13 (Бесплатно)',
                'Абинск' : 'Самовывоз: пр-т Комсомольский, 110“А”/3 (Бесплатно)',
                'Адлер' : 'Самовывоз: ул. Просвещения, 118б (Бесплатно)',
                'Азов' : 'Самовывоз: ул. Измайлова, 55 (Бесплатно)',
                'Аксай' : 'Самовывоз: ул. Садовая, 31 (Бесплатно)',
                'Алапаевск' : 'Самовывоз: ул. 3-го Интернационала, 22 (Бесплатно)',
                'Александров' : 'Самовывоз: ул. Институтская, 10 (Бесплатно)',
                'Алексеевка' : 'Самовывоз: ул. Победы, 51б (Бесплатно)',
                'Алексин' : 'Самовывоз: ул. Тульская, 8 (Бесплатно)',
                'Алушта' : 'Самовывоз: ул. Таврическая, 4а (Бесплатно)',
        }        
        
        for (i in shopAdress) {
          if (apiCity.match(i) == i) {
          delivery = shopAdress[i]
          flag = false
          break
          } 
        }
  
        if (flag == true) {
          for (ii in deliveryAdress) {
            if (apiCity.match(ii) == ii) {
            delivery = deliveryAdress[ii]
            flag = false
            break
            }
          }
        }
        
        if (flag == true) {
            apiCity = 'Бесплатная доставка'
            delivery = 'по городам России (подробности по телефону)'
        }

        $('#town').html(apiCity); 
        $('#delivery').html(delivery);
